bcmi-labs/arduino-core-stm32f4/cores/arduino/usb/usbd_cdc_if.c
/**
  ******************************************************************************
  * @file           : usbd_cdc_if.c
  * @brief          :
  ******************************************************************************
  * COPYRIGHT(c) 2016 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  * 1. Redistributions of source code must retain the above copyright notice,
  * this list of conditions and the following disclaimer.
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  * this list of conditions and the following disclaimer in the documentation
  * and/or other materials provided with the distribution.
  * 3. Neither the name of STMicroelectronics nor the names of its contributors
  * may be used to endorse or promote products derived from this software
  * without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
*/

/* Includes ------------------------------------------------------------------*/
#include "usbd_cdc_if.h"
#include "stm32f4xx_hal.h"

#ifdef __cplusplus
 extern "C" {
#endif

/* USER CODE BEGIN INCLUDE */
/* USER CODE END INCLUDE */

/** @addtogroup STM32_USB_OTG_DEVICE_LIBRARY
  * @{
  */

/** @defgroup USBD_CDC 
  * @brief usbd core module
  * @{
  */ 

/** @defgroup USBD_CDC_Private_TypesDefinitions
  * @{
  */ 
/* USER CODE BEGIN PRIVATE TYPES  */
//uint8_t buffer[32];
//<<<<<<< HEAD
//=======
int enterDFU = 0;
//extern uint8_t *Rbuffer;
//>>>>>>> USB-CDC
/* USER CODE END PRIVATE TYPES */ 
/**
  * @}
  */ 

/** @defgroup USBD_CDC_Private_Defines
  * @{
  */ 
/* USER CODE BEGIN PRIVATE DEFINES  */
/* Define size for the receive and transmit buffer over CDC */
/* It's up to user to redefine and/or remove those define */
/* USER CODE END PRIVATE DEFINES */
/**
  * @}
  */ 

/** @defgroup USBD_CDC_Private_Macros
  * @{
  */ 
/* USER CODE BEGIN PRIVATE_MACRO  */
/* USER CODE END PRIVATE_MACRO */

/**
  * @}
  */ 
  
/** @defgroup USBD_CDC_Private_Variables
  * @{
  */
/* Create buffer for reception and transmission           */
/* It's up to user to redefine and/or remove those define */
/* Received Data over USB are stored in this buffer       */
__IO uint8_t UserRxBufferFS[APP_RX_DATA_SIZE];
__IO uint8_t StackRxBufferFS[APP_RX_DATA_SIZE];

/* Send Data over USB CDC are stored in this buffer       */
__IO uint8_t UserTxBufferFS[APP_TX_DATA_SIZE];
__IO uint8_t StackTxBufferFS[APP_TX_DATA_SIZE];

__IO uint32_t UserTxBufPtrIn = 0; /* Increment this pointer or roll it back to
                               start address when data are received over write call */
__IO uint32_t UserTxBufPtrOut = 0; /* Increment this pointer or roll it back to
                                 start address when data are sent over USB */
                 
__IO uint32_t UserRxBufPtrIn = 0; /* Increment this pointer or roll it back to
                               start address when data are received over USB */
__IO uint32_t UserRxBufPtrOut = 0; /* Increment this pointer or roll it back to
                                 start address when data are sent over read call */

__IO uint32_t SLP;
__IO uint32_t GetRxCount;
__IO uint32_t lineState = 0;
uint8_t cptlineState = 0;

/* Default configuration: 115200, 8N1 */
uint8_t lineSetup[] = {0x00, 0x00, 0x20, 0x1c, 0x00, 0x00, 0x08};

#define CDC_POLLING_INTERVAL             5 /* in ms. The max is 65 and the min is 1 */

TIM_HandleTypeDef  TimHandle;

static void TIM_Config(void);
  
/* USB handler declaration */
/* Handle for USB Full Speed IP */
//  USBD_HandleTypeDef  *hUsbDevice_0;
/* USER CODE BEGIN PRIVATE_VARIABLES  */
/* USER CODE END  PRIVATE VARIABLES */

/**
  * @}
  */ 
  
/** @defgroup USBD_CDC_IF_Exported_Variables
  * @{
  */ 
extern USBD_HandleTypeDef hUsbDeviceFS;
/* USER CODE BEGIN EXPORTED_VARIABLES  */
/* USER CODE END  EXPORTED_VARIABLES */

/**
  * @}
  */ 
  
/** @defgroup USBD_CDC_Private_FunctionPrototypes
  * @{
  */
static int8_t CDC_Init_FS     (void);
static int8_t CDC_DeInit_FS   (void);
static int8_t CDC_Control_FS  (uint8_t cmd, uint8_t* pbuf, uint16_t length);
static int8_t CDC_Receive_FS  (uint8_t* pbuf, uint32_t *Len);

/* USER CODE BEGIN PRIVATE_FUNCTIONS_DECLARATION */
/* USER CODE END  PRIVATE_FUNCTIONS_DECLARATION */

/**
  * @}
  */ 
  
USBD_CDC_ItfTypeDef USBD_Interface_fops_FS = 
{
  CDC_Init_FS,
  CDC_DeInit_FS,
  CDC_Control_FS,  
  CDC_Receive_FS
};

/* Private functions ---------------------------------------------------------*/
/**
  * @brief  CDC_Init_FS
  *         Initializes the CDC media low layer over the FS USB IP
  * @param  None
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_Init_FS(void)
{
  /*##-3- Configure the TIM Base generation  #################################*/
  TIM_Config();
  
  /*##-4- Start the TIM Base generation in interrupt mode ####################*/
  /* Start Channel1 */
  HAL_TIM_Base_Start_IT(&TimHandle);
  
//  GPIO_InitTypeDef  gpio_init_structure;  
//  //hUsbDevice_0 = &hUsbDeviceFS;
//  /* USER CODE BEGIN 3 */ 
//  /* Set Application Buffers */
  USBD_CDC_SetTxBuffer(&hUsbDeviceFS, UserTxBufferFS, 1);
  USBD_CDC_SetRxBuffer(&hUsbDeviceFS, StackRxBufferFS);
//  

//  
//  __HAL_RCC_GPIOK_CLK_ENABLE();
//  
//    gpio_init_structure.Pin   = GPIO_PIN_3;
//    gpio_init_structure.Mode  = GPIO_MODE_OUTPUT_PP;
//    gpio_init_structure.Pull  = GPIO_PULLUP;
//    gpio_init_structure.Speed = GPIO_SPEED_HIGH;
//  
//    HAL_GPIO_Init(HAL_GPIOK, &gpio_init_structure);
//  

//    /* By default, turn off LED by setting a high level on corresponding GPIO */
//    HAL_GPIO_WritePin(HAL_GPIOK, GPIO_PIN_3, GPIO_PIN_SET);
  
  return (USBD_OK);
  /* USER CODE END 3 */ 
}

/**
  * @brief  CDC_DeInit_FS
  *         DeInitializes the CDC media low layer
  * @param  None
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_DeInit_FS(void)
{
  /* USER CODE BEGIN 4 */ 
  return (USBD_OK);
  /* USER CODE END 4 */ 
}

/**
  * @brief  CDC_Control_FS
  *         Manage the CDC class requests
  * @param  cmd: Command code            
  * @param  pbuf: Buffer containing command data (request parameters)
  * @param  length: Number of data to be sent (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */
static int8_t CDC_Control_FS  (uint8_t cmd, uint8_t* pbuf, uint16_t length)
{ 
  /* USER CODE BEGIN 5 */
  switch (cmd)
  {
  case CDC_SEND_ENCAPSULATED_COMMAND:
 
    break;

  case CDC_GET_ENCAPSULATED_RESPONSE:
 
    break;

  case CDC_SET_COMM_FEATURE:
 
    break;

  case CDC_GET_COMM_FEATURE:

    break;

  case CDC_CLEAR_COMM_FEATURE:

    break;

  /*******************************************************************************/
  /* Line Coding Structure                                                       */
  /*-----------------------------------------------------------------------------*/
  /* Offset | Field       | Size | Value  | Description                          */
  /* 0      | dwDTERate   |   4  | Number |Data terminal rate, in bits per second*/
  /* 4      | bCharFormat |   1  | Number | Stop bits                            */
  /*                                        0 - 1 Stop bit                       */
  /*                                        1 - 1.5 Stop bits                    */
  /*                                        2 - 2 Stop bits                      */
  /* 5      | bParityType |  1   | Number | Parity                               */
  /*                                        0 - None                             */
  /*                                        1 - Odd                              */ 
  /*                                        2 - Even                             */
  /*                                        3 - Mark                             */
  /*                                        4 - Space                            */
  /* 6      | bDataBits  |   1   | Number Data bits (5, 6, 7, 8 or 16).          */
  /*******************************************************************************/
  case CDC_SET_LINE_CODING:
    memcpy(lineSetup, pbuf, 7);

    if(*((uint32_t*)pbuf) == 1200){
      /* Set magic number in SRAM so application enters DFU after reset */
      *((unsigned int*)0x2004FFF0) = 0xb311a21a;
      NVIC_SystemReset();
    }

    break;

  case CDC_GET_LINE_CODING:
    memcpy(pbuf, lineSetup, 7);
    break;

  case CDC_SET_CONTROL_LINE_STATE:
    cptlineState++;
    if(cptlineState == 2)
    lineState = 1; 
    break;

  case CDC_SEND_BREAK:
 
    break;    
    
  default:
    break;
  }

  return (USBD_OK);
  /* USER CODE END 5 */
}

/**
  * @brief  CDC_Receive_FS
  *         Data received over USB OUT endpoint are sent over CDC interface 
  *         through this function.
  *           
  *         @note
  *         This function will block any OUT packet reception on USB endpoint 
  *         untill exiting this function. If you exit this function before transfer
  *         is complete on CDC interface (ie. using DMA controller) it will result 
  *         in receiving more data while previous ones are still not sent.
  *                 
  * @param  Buf: Buffer of data to be received
  * @param  Len: Number of data received (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL
  */

static int8_t CDC_Receive_FS (uint8_t* Buf, uint32_t *Len)
{

  //USBD_CDC_SetTxBuffer(&hUsbDeviceFS, UserTxBufferFS, 1); 
  
  
//    USBD_CDC_SetTxBuffer(&hUsbDeviceFS, Buf, *Len);
//    USBD_CDC_TransmitPacket(&hUsbDeviceFS);
  
//  /* Transmit after reception data */
//  if(USBD_CDC_TransmitPacket(&hUsbDeviceFS) == USBD_FAIL)
//  {
//    HAL_GPIOK->ODR ^= GPIO_PIN_3;
//  }
  
//  HAL_GPIOK->ODR ^= GPIO_PIN_3;
  //while(1); 
  //USBD_CDC_TransmitPacket(&hUsbDevice_0);
  /* USER CODE BEGIN 6 */
  /* Initiate next USB packet transfer once a packet is received */
  
  if(UserRxBufPtrIn + (*Len) > APP_RX_DATA_SIZE)
  {
    memcpy(&UserRxBufferFS[UserRxBufPtrIn], &Buf[0], (APP_RX_DATA_SIZE - UserRxBufPtrIn));
  memcpy(&UserRxBufferFS[0], &Buf[(APP_RX_DATA_SIZE - UserRxBufPtrIn)], ((*Len) - (APP_RX_DATA_SIZE - UserRxBufPtrIn)));
  UserRxBufPtrIn = ((UserRxBufPtrIn + (*Len)) % APP_RX_DATA_SIZE);
  } else
  {
    memcpy(&UserRxBufferFS[UserRxBufPtrIn], Buf, (*Len));
  UserRxBufPtrIn = ((UserRxBufPtrIn + (*Len)) % APP_RX_DATA_SIZE);
  }

  //USBD_CDC_SetRxBuffer(&hUsbDeviceFS, Rbuffer);
  USBD_CDC_ReceivePacket(&hUsbDeviceFS);  
  return (USBD_OK);
  /* USER CODE END 6 */ 
}

/**
  * @brief  CDC_Transmit_FS
  *         Data send over USB IN endpoint are sent over CDC interface 
  *         through this function.           
  *         @note
  *         
  *                 
  * @param  Buf: Buffer of data to be send
  * @param  Len: Number of data to be send (in bytes)
  * @retval Result of the operation: USBD_OK if all operations are OK else USBD_FAIL or USBD_BUSY
  */
uint8_t CDC_Transmit_FS(uint8_t* Buf, uint16_t Len)
{
  uint8_t result = USBD_OK;
  /* USER CODE BEGIN 7 */ 
  //USBD_CDC_SetTxBuffer(hUsbDevice_0, Buf, Len);
  USBD_CDC_SetTxBuffer(&hUsbDeviceFS, UserTxBufferFS, 1); 
  result = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
  /* USER CODE END 7 */ 
  return result;
}

void CDC_flush(void)
{
  uint8_t status;
  
  HAL_TIM_Base_Stop_IT(&TimHandle);
  
  if(UserTxBufPtrOut != UserTxBufPtrIn)
  {
    if(UserTxBufPtrOut > UserTxBufPtrIn) /* Roll-back */
    {
      memcpy((uint8_t*)&StackTxBufferFS[0], (uint8_t*)&UserTxBufferFS[UserTxBufPtrOut], (APP_TX_DATA_SIZE - UserTxBufPtrOut));
    
      memcpy((uint8_t*)&StackTxBufferFS[APP_TX_DATA_SIZE - UserTxBufPtrOut], (uint8_t*)&UserTxBufferFS[0], UserTxBufPtrIn);
    
      USBD_CDC_SetTxBuffer(&hUsbDeviceFS, (uint8_t*)&StackTxBufferFS[0], (APP_TX_DATA_SIZE - UserTxBufPtrOut + UserTxBufPtrIn));
    
      status = USBD_CDC_TransmitPacket(&hUsbDeviceFS);

      if(status == USBD_OK)
      {
        UserTxBufPtrOut = UserTxBufPtrIn;
      }
    }
    else 
    {
      USBD_CDC_SetTxBuffer(&hUsbDeviceFS, (uint8_t*)&UserTxBufferFS[UserTxBufPtrOut], (UserTxBufPtrIn - UserTxBufPtrOut));
    
      status = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
    
      if(status == USBD_OK)
      {
        UserTxBufPtrOut = UserTxBufPtrIn;
      }
    }
  }
  
  HAL_TIM_Base_Start_IT(&TimHandle);
}

void CDC_disable_TIM_Interrupt(void)
{
  HAL_TIM_Base_Stop_IT(&TimHandle);
}

void CDC_enable_TIM_Interrupt(void)
{
  HAL_TIM_Base_Start_IT(&TimHandle);
}

static void TIM_Config(void)
{  
  /* Set TIMx instance */
  TimHandle.Instance = HAL_TIM6;
  
  /* Initialize TIM6 peripheral as follow:
       + Period = 10000 - 1
       + Prescaler = ((SystemCoreClock/2)/10000) - 1
       + ClockDivision = 0
       + Counter direction = Up
  */
  TimHandle.Init.Period = (CDC_POLLING_INTERVAL*1000) - 1;
  TimHandle.Init.Prescaler = 84-1;
  TimHandle.Init.ClockDivision = 0;
  TimHandle.Init.CounterMode = TIM_COUNTERMODE_UP;
  
  /*##-6- Enable TIM peripherals Clock #######################################*/
  __HAL_RCC_TIM6_CLK_ENABLE();
  
  /*##-7- Configure the NVIC for TIMx ########################################*/
  /* Set Interrupt Group Priority */ 
  HAL_NVIC_SetPriority(TIM6_DAC_IRQn, 6, 0);
  
  /* Enable the TIMx global Interrupt */
  HAL_NVIC_EnableIRQ(TIM6_DAC_IRQn);
  
  HAL_TIM_Base_Init(&TimHandle);
}

void __irq_tim6(void)
{
  HAL_TIM_IRQHandler(&TimHandle);
}

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  uint8_t status;
  
  if(UserTxBufPtrOut != UserTxBufPtrIn)
  {
    if(UserTxBufPtrOut > UserTxBufPtrIn) /* Roll-back */
    {
      memcpy((uint8_t*)&StackTxBufferFS[0], (uint8_t*)&UserTxBufferFS[UserTxBufPtrOut], (APP_TX_DATA_SIZE - UserTxBufPtrOut));
    
      memcpy((uint8_t*)&StackTxBufferFS[APP_TX_DATA_SIZE - UserTxBufPtrOut], (uint8_t*)&UserTxBufferFS[0], UserTxBufPtrIn);
    
      USBD_CDC_SetTxBuffer(&hUsbDeviceFS, (uint8_t*)&StackTxBufferFS[0], (APP_TX_DATA_SIZE - UserTxBufPtrOut + UserTxBufPtrIn));
    
      status = USBD_CDC_TransmitPacket(&hUsbDeviceFS);

      if(status == USBD_OK)
      {
        UserTxBufPtrOut = UserTxBufPtrIn;
      }
    }
    else 
    {
      USBD_CDC_SetTxBuffer(&hUsbDeviceFS, (uint8_t*)&UserTxBufferFS[UserTxBufPtrOut], (UserTxBufPtrIn - UserTxBufPtrOut));
    
      status = USBD_CDC_TransmitPacket(&hUsbDeviceFS);
    
      if(status == USBD_OK)
      {
        UserTxBufPtrOut = UserTxBufPtrIn;
      }
    }
  }
}

/* USER CODE BEGIN PRIVATE_FUNCTIONS_IMPLEMENTATION */
/* USER CODE END  PRIVATE_FUNCTIONS_IMPLEMENTATION */

/**
  * @}
  */ 

/**
  * @}
  */

#ifdef __cplusplus
}
#endif  

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/